[net]
batch=1
subdivisions=1

height=1
width=12634
channels=1

learning_rate=0.00001
momentum=0.9
decay=0.0005

max_batches = 32

#0
[activation]
activation=linear

#1
[connected]
output=64
activation=relu

#########     filters = 4
###################           strides = 1
#2
[route]
layers=-2

#3
[convolutional1D]
filters=4
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#4
[route]
layers=-4

#5
[convolutional1D]
filters=4
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#6
[shortcut]
from=-3
activation=relu

#########     filters = 8
###################           strides = 1
#7
[convolutional1D]
filters=8
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#8
[route]
layers=-2

#9
[convolutional1D]
filters=8
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#10
[shortcut]
from=-3
activation=relu

###################           strides = 2
#11
[convolutional1D]
filters=8
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#12
[route]
layers=-2

#13
[avgpoolx1D]
size=2
stride=2

#14
[convolutional1D]
filters=8
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#15
[shortcut]
from=-4
activation=relu

#########     filters = 16
###################           strides = 1
#16
[convolutional1D]
filters=16
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#17
[route]
layers=-2

#18
[convolutional1D]
filters=16
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#19
[shortcut]
from=-3
activation=relu

###################           strides = 2
#20
[convolutional1D]
filters=16
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#21
[route]
layers=-2

#22
[avgpoolx1D]
size=2
stride=2


#23
[convolutional1D]
filters=16
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#24
[shortcut]
from=-4
activation=relu

#########     filters = 32
###################           strides = 1
#25
[convolutional1D]
filters=32
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#26
[route]
layers=-2

#27
[convolutional1D]
filters=32
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#28
[shortcut]
from=-3
activation=relu

###################           strides = 2
#29
[convolutional1D]
filters=32
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#30
[route]
layers=-2

#31
[avgpoolx1D]
size=2
stride=2


#32
[convolutional1D]
filters=32
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#33
[shortcut]
from=-4
activation=relu

#########     filters = 64
###################           strides = 1
#34
[convolutional1D]
filters=64
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#35
[route]
layers=-2

#36
[convolutional1D]
filters=64
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#37
[shortcut]
from=-3
activation=relu

###################           strides = 2
#38
[convolutional1D]
filters=64
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#39
[route]
layers=-2

#40
[avgpoolx1D]
size=2
stride=2


#41
[convolutional1D]
filters=64
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#42
[shortcut]
from=-4
activation=relu

#########     filters = 128
###################           strides = 1
#43
[convolutional1D]
filters=128
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#44
[route]
layers=-2

#45
[convolutional1D]
filters=128
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#46
[shortcut]
from=-3
activation=relu

###################           strides = 2
#47
[convolutional1D]
filters=128
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#48
[route]
layers=-2

#49
[avgpoolx1D]
size=2
stride=2


#50
[convolutional1D]
filters=128
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#51
[shortcut]
from=-4
activation=relu

#########     filters = 256
###################           strides = 1
#52
[convolutional1D]
filters=256
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#53
[route]
layers=-2

#54
[convolutional1D]
filters=256
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#55
[shortcut]
from=-3
activation=relu

###################           strides = 2
#56
[convolutional1D]
filters=256
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#57
[route]
layers=-2

#58
[avgpoolx1D]
size=2
stride=2


#59
[convolutional1D]
filters=256
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#60
[shortcut]
from=-4
activation=relu

#########     filters = 512
###################           strides = 1
#61
[convolutional1D]
filters=512
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#62
[route]
layers=-2

#63
[convolutional1D]
filters=512
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#64
[shortcut]
from=-3
activation=relu

###################           strides = 2
#65
[convolutional1D]
filters=512
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#66
[route]
layers=-2

#67
[avgpoolx1D]
size=2
stride=2


#68
[convolutional1D]
filters=512
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#69
[shortcut]
from=-4
activation=relu

#########     filters = 1024
###################           strides = 1
#70
[convolutional1D]
filters=1024
size=3
stride=1
pad=1
activation=linear
batch_normalize=1

#71
[route]
layers=-2

#72
[convolutional1D]
filters=1024
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#73
[shortcut]
from=-3
activation=relu

###################           strides = 2
#74
[convolutional1D]
filters=1024
size=3
stride=2
pad=1
activation=linear
batch_normalize=1

#75
[route]
layers=-2

#76
[avgpoolx1D]
size=2
stride=2


#77
[convolutional1D]
filters=1024
size=1
stride=1
pad=1
activation=linear
batch_normalize=1

#78
[shortcut]
from=-4
activation=relu


# DONE with risidual layers

#concatnate two layers
[route]
layers=-1,1

[connected]
output=32
activation=relu

[connected]
output=1
activation=logistic

#[softmax]
#[cost]