[net]
batch=128
subdivisions=2
enclave_subdivisions=2
gradient_update_clip=0.005

height=32
width=32
channels=3
max_crop=32
min_crop=32

hue=.1
saturation=.75
exposure=.75

learning_rate=0.1
#burn_in=400
policy=poly
power=4
max_batches=10000
momentum=0.9
decay=0.0005

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=leaky
batch_normalize=1

[maxpool]
size=2
stride=2

[convolutional]
filters=16
size=1
stride=1
pad=1
activation=leaky
batch_normalize=1

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=leaky
batch_normalize=1

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=leaky
batch_normalize=1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=leaky
batch_normalize=1

[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky
batch_normalize=1

[convolutional]
filters=10
size=1
stride=1
pad=1
activation=leaky
batch_normalize=1


[avgpool]

[softmax]
groups=1